[
  {
    "title": "Adi M is \"The Next Winner\"",
    "author": "Tayo Odutola",
    "text": "Orlando Florida based producer and rapper Adi M is next up to bat as he delivers an all-out bravado laced single titled “The Next Winner.”  The self-produced track is a testament to the emerging act’s lyrical prowess and ability behind the boards as well. </br></br>He makes use of a heavy and somewhat ominous backdrop to pass his message across and he does so effortlessly. The smooth flow and fiery delivery also adds to up the ante in many ways and keeps the track from being a run of the mill type track.",
    "link": "https://www.thewordisbond.com/adi-m-is-the-next-winner/"
  },
  {
    "title": "Adi M releases a great new rap track called “Never Been Easy”",
    "author": "Reingland Magazine",
    "text": "Adi M released a hot n ready new track called “Never Been Easy” Never Been Easy is a song understanding that the road to being a successful artist is tough but to nevertheless work hard and aspire for the throne. No matter the numbers or the stats, success will come in time if patient. Keep believing in yourself while giving your 100% This is a powerful track for anyone needing that extra positive push, but entertaining at the same time. Loved it, great project! Just check out the track and please share your feedback below.",
    "link": "https://www.reignland.co/adi-m-never-been-easy/"
  },
  {
    "title": "Adi M goes for gold on ”Never Been Easy”",
    "author": "Tayo Odutola",
    "text": "Orlando Florida based producer and rapper Adi M is back in the field and drops a new single “Never Been Easy” that explores his journey thus far in life and the music industry in general. </br></br>The self-produced track has a nice bounce and soulful sample flip that gives it a somewhat introspective feel. Adi M sure pours his all into the track and lets the listener know that he is fully dedicated to his work and is willing to do what it takes. He also details all the side distractions and the numeroous challenges he faced and might face along the way. Finally he adds that “…No matter the numbers or the stats, success will come in time if patient and believe in yourself while giving your 100%.”",
    "link": "https://www.thewordisbond.com/adi-m-goes-for-gold-onnever-been-easy-twib-premiere/"
  }
]
